import { Store } from "@/types/store";

export const mockStores: Store[] = [
  {
    id: "1",
    name: "향설 1관",
    menu: ["현미밥", "제육볶음", "미역국", "샐러드"],
    remain: 20,
    address: "충남 아산시 신창면 순천향로 1",
    phone: "041-000-0001",
    hours: "08:00 ~ 소진 시",
    position: { lat: 36.7688, lng: 126.9323 },
    weeklyMenu: [
      ["현미밥", "제육볶음", "미역국", "샐러드"],
      ["잡곡밥", "닭갈비", "된장국", "김치"],
      ["쌀밥", "생선구이", "미소된장국", "무생채"],
      ["현미밥", "두부조림", "미역국", "나물"],
      ["잡곡밥", "불고기", "콩나물국", "깍두기"]
    ]
  },
  {
    id: "2",
    name: "야외 그라찌에",
    menu: ["소보로빵", "요거트", "우유"],
    remain: 12,
    address: "충남 아산시 신창면 순천향로 22",
    phone: "041-000-0002",
    hours: "08:00 ~ 소진 시",
    position: { lat: 36.7712, lng: 126.9327 },
    weeklyMenu: [
      ["소보로빵", "요거트", "우유"],
      ["크로와상", "요플레", "두유"],
      ["식빵", "잼", "우유"],
      ["롤케익", "요거트", "우유"],
      ["소보로빵", "우유", "바나나"]
    ]
  },
  {
    id: "3",
    name: "베이커리 경",
    menu: ["인절미", "쿠키", "음료 중 택 1"],
    remain: 0,
    address: "충남 아산시 신창면 순천향로 33",
    phone: "041-000-0003",
    hours: "08:00 ~ 소진 시",
    position: { lat: 36.774667, lng: 126.93362 },
    weeklyMenu: [
      ["인절미", "쿠키", "커피"],
      ["찹쌀떡", "쿠키", "우유"],
      ["모찌", "쿠키", "바나나우유"],
      ["인절미", "크래커", "두유"],
      ["떡", "쿠키", "쥬스"]
    ]
  }
];

export const notices = [
  {
    id: '1',
    title: '오류 수정 안내',
    date: '2025. 08. 01',
    content: '공지사항 상세내용입니다.',
    isNew: true
  },
  {
    id: '2',
    title: '교내 식당 운영시간 업데이트',
    date: '2025. 07. 30',
    content: '운영시간이 변경되었습니다.',
  },
  {
    id: '3',
    title: '천원의 아침밥 서비스 시작',
    date: '2025. 07. 28',
    content: '드디어 시작합니다!',
  }
];